In [2]:
import pandas as pd

data = {
    'city' : ['서울','경기도','제주','부산'],
    'total1' : [12588,35162,26272,3416],
    'total2' : [12600,35100,26200,34006]
    
}
data_frame = pd.DataFrame(data)
data_frame

In [6]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    4 non-null      object
 1   total1  4 non-null      int64
 2   total2  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [7]:
data_frame.dtypes

city      object
total1     int64
total2     int64
dtype: object

In [12]:
data_frame.city

0     서울
1    경기도
2     제주
3     부산
Name: city, dtype: object

In [16]:
type(data_frame.city)

pandas.core.series.Series

In [18]:
#오브젝트
data_frame.city.dtypes

dtype('O')

In [19]:
data_frame.total1.dtype

dtype('int64')

In [21]:
## 컬럼 total2 값을 오름 차순으로 보고 싶어 행 정렬

data_frame.sort_values('total2')

  city  total1  total2
0   서울   12588   12600
2   제주   26272   26200
3   부산    3416   34006
1  경기도   35162   35100

In [22]:
# 문제 컬럼 total2의 값을 내림차순 정렬, 원본 저장
data_frame.sort_values('total2',
                       ascending=False,
                       inplace=True)

In [23]:
data_frame

  city  total1  total2
1  경기도   35162   35100
3   부산    3416   34006
2   제주   26272   26200
0   서울   12588   12600

In [29]:
#인덱스 기준으로 오름차순 정렬
data_frame.sort_index()

  city  total1  total2
0   서울   12588   12600
1  경기도   35162   35100
2   제주   26272   26200
3   부산    3416   34006

In [31]:
#인덱스 기준으로 내림차순 정렬
data_frame.sort_index(ascending=False)

  city  total1  total2
3   부산    3416   34006
2   제주   26272   26200
1  경기도   35162   35100
0   서울   12588   12600

In [32]:
data_frame

  city  total1  total2
1  경기도   35162   35100
3   부산    3416   34006
2   제주   26272   26200
0   서울   12588   12600

### 인덱스 재설정
- 기본의 인덱스를 남기고 추가한다.
- 복사본이에용

In [33]:
data_frame.reset_index()

   index city  total1  total2
0      1  경기도   35162   35100
1      3   부산    3416   34006
2      2   제주   26272   26200
3      0   서울   12588   12600

### 인덱스 재설정, 기존 인덱스 삭제 :복사본

In [43]:
data_frame.reset_index(drop=True)

  city  total1  total2
0  경기도   35162   35100
1   부산    3416   34006
2   제주   26272   26200
3   서울   12588   12600

### 인덱스 재설정, 기존 인덱스 삭제 :원본 적용

In [45]:
data_frame.reset_index(drop=True,inplace=True)
data_frame

  city  total1  total2
0  경기도   35162   35100
1   부산    3416   34006
2   제주   26272   26200
3   서울   12588   12600

### 컬럼
### 열의 인덱스

In [49]:
data_frame.columns[:1](sum)

TypeError: 'Index' object is not callable

In [53]:
#컬럼명 변경 : 일부, 원본 적용
# total1 - > 총합1
data_frame.rename(columns={'total1':'총합1'},inplace=True)
data_frame

  city    총합1  total2
0  경기도  35162   35100
1   부산   3416   34006
2   제주  26272   26200
3   서울  12588   12600

In [72]:
# 조건에 맞는 데이터 행 추출
# 지역이 서울
#먼저 조건 검색 하고 나서 찾아 주면 되용
data_frame.loc[data_frame.city == '서울']
data_frame[data_frame.city == '서울']

  city    총합1  total2
3   서울  12588   12600

In [74]:
## 총합1에 값이 2만 이상
data_frame[data_frame.총합1 > 20000]

  city    총합1  total2
0  경기도  35162   35100
2   제주  26272   26200

In [90]:
#총합1 total2 모두 2만 이상
# and : &
# or : |
data_frame[(data_frame.총합1 >= 20000) & (data_frame.total2 >= 20000)]

  city    총합1  total2
0  경기도  35162   35100
2   제주  26272   26200

In [108]:
#city에서 산이 포함된 데이터 추출
# str 메서드 문자열 함수 가능 .contains() 포함하는 메서드
data_frame[data_frame.city.str.contains('산')]

  city   총합1  total2
1   부산  3416   34006